export default {
  projections: {
    ДокументЗаказаE: {
      кодДокумента: {
        __caption__: 'Код документа'
      },
      датаДокумента: {
        __caption__: 'Дата документа'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      заказСобран: {
        __caption__: 'Заказ собран'
      },
      заказОтправ: {
        __caption__: 'Заказ отправлен'
      },
      заказПолучен: {
        __caption__: 'Заказ получен'
      }
    },
    ДокументЗаказаL: {
      кодДокумента: {
        __caption__: 'Код документа'
      },
      датаДокумента: {
        __caption__: 'Дата документа'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      заказСобран: {
        __caption__: 'Заказ собран'
      },
      заказОтправ: {
        __caption__: 'Заказ отправлен'
      },
      заказПолучен: {
        __caption__: 'Заказ получен'
      },
      питание: {
        __caption__: 'Код питания',
        кодПитания: {
          __caption__: 'Код питания'
        },
        видПитания: {
          __caption__: 'Вид питания'
        }
      },
      контрагенты: {
        __caption__: 'Код контрагента',
        кодКонтиагента: {
          __caption__: 'Код контрагента'
        },
        наименование: {
          __caption__: 'Наименование контрагента'
        }
      },
      сотрудники: {
        __caption__: 'Фамилия сотрудника',
        фамилия: {
          __caption__: 'Фамилия сотрудника'
        },
        имя: {
          __caption__: 'Имя сотрудника'
        },
        отчество: {
          __caption__: 'Отчество сотрудника'
        },
        должности: {
          __caption__: '',
          наименование: {
            __caption__: 'Должность'
          }
        }
      }
    }
  },
  validations: {
    датаДокумента: {
      __caption__: 'Дата документа'
    },
    заказОтправ: {
      __caption__: 'Заказ отправлен'
    },
    заказПолучен: {
      __caption__: 'Заказ получен'
    },
    заказСобран: {
      __caption__: 'Заказ собран'
    },
    кодДокумента: {
      __caption__: 'Код документа'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    контрагенты: {
      __caption__: 'Код контрагента'
    },
    питание: {
      __caption__: 'Код питания'
    },
    сотрудники: {
      __caption__: 'Фамилия сотрудника'
    }
  }
};
