export default {
  projections: {
    РегистрБлюдE: {
      кодБлюда: {
        __caption__: 'Код блюда'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      количество: {
        __caption__: 'Количество'
      },
      цена: {
        __caption__: 'Цена'
      }
    }
  },
  validations: {
    кодБлюда: {
      __caption__: 'Код блюда'
    },
    количество: {
      __caption__: 'Количество'
    },
    наименование: {
      __caption__: 'Наименование'
    },
    цена: {
      __caption__: 'Цена'
    },
    питание: {
      __caption__: 'питание'
    }
  }
};
