export default {
  projections: {
    ПитаниеE: {
      кодПитания: {
        __caption__: 'Код питания'
      },
      видПитания: {
        __caption__: 'Вид питания'
      },
      регистрБлюд: {
        __caption__: 'Блюда',
        кодБлюда: {
          __caption__: 'Код блюда'
        },
        наименование: {
          __caption__: 'Наименование'
        },
        количество: {
          __caption__: 'Количество'
        },
        цена: {
          __caption__: 'Цена'
        }
      }
    },
    ПитаниеL: {
      кодПитания: {
        __caption__: 'Код питания'
      },
      видПитания: {
        __caption__: 'Вид питания'
      }
    }
  },
  validations: {
    видПитания: {
      __caption__: 'Вид питания'
    },
    кодПитания: {
      __caption__: 'Код питания'
    },
    регистрБлюд: {
      __caption__: 'Блюда'
    }
  }
};
